ProjectSales/src/Documents/Sales/Sales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Sales</name>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>Good</name>
      <type>
        <types>CatalogRef.Goods</types>
      </type>
    </attributes>
    <attributes>
      <name>Count</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Cost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ProjectSales/src/Documents/Sales/Forms/DocumentForm/Module.bsl
&НаКлиенте
Процедура GoodsCountПриИзменении(Элемент)
	Стр 	= Элементы.Goods.ТекущиеДанные;
	Стр.Sum = Стр.Count * Стр.Cost;
КонецПроцедуры

&НаКлиенте
Процедура GoodsCostПриИзменении(Элемент)
	Стр 	= Элементы.Goods.ТекущиеДанные;
	Стр.Sum = Стр.Count * Стр.Cost;
КонецПроцедуры
